// Data injected from Python
        const RAW_DATA = [
  {
    "รหัสรายการ": "S001",
    "วันที่": "2026-08-01",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S002",
    "วันที่": "2026-08-01",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 6,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S003",
    "วันที่": "2026-08-01",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S004",
    "วันที่": "2026-08-01",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 7,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S005",
    "วันที่": "2026-08-02",
    "สาขา": "สำนักงาน",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S006",
    "วันที่": "2026-08-02",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 4,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S007",
    "วันที่": "2026-08-02",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 20,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S008",
    "วันที่": "2026-08-03",
    "สาขา": "สำนักงาน",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 6,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S009",
    "วันที่": "2026-08-03",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S010",
    "วันที่": "2026-08-03",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S011",
    "วันที่": "2026-08-04",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S012",
    "วันที่": "2026-08-04",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S013",
    "วันที่": "2026-08-04",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 16,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S014",
    "วันที่": "2026-08-05",
    "สาขา": "สำนักงาน",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S015",
    "วันที่": "2026-08-05",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S016",
    "วันที่": "2026-08-05",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 19,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S017",
    "วันที่": "2026-08-05",
    "สาขา": "สำนักงาน",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S018",
    "วันที่": "2026-08-06",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 2,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S019",
    "วันที่": "2026-08-06",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 16,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S020",
    "วันที่": "2026-08-06",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 6,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S021",
    "วันที่": "2026-08-07",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S022",
    "วันที่": "2026-08-07",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 19,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S023",
    "วันที่": "2026-08-07",
    "สาขา": "สำนักงาน",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S024",
    "วันที่": "2026-08-08",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 4,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S025",
    "วันที่": "2026-08-08",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S026",
    "วันที่": "2026-08-08",
    "สาขา": "สำนักงาน",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S027",
    "วันที่": "2026-08-09",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S028",
    "วันที่": "2026-08-09",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S029",
    "วันที่": "2026-08-09",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S030",
    "วันที่": "2026-08-09",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 6,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S031",
    "วันที่": "2026-08-10",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S032",
    "วันที่": "2026-08-10",
    "สาขา": "สำนักงาน",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 6,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S033",
    "วันที่": "2026-08-10",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S034",
    "วันที่": "2026-08-11",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S035",
    "วันที่": "2026-08-11",
    "สาขา": "สำนักงาน",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 3,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S036",
    "วันที่": "2026-08-11",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S037",
    "วันที่": "2026-08-12",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S038",
    "วันที่": "2026-08-12",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S039",
    "วันที่": "2026-08-12",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 3,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S040",
    "วันที่": "2026-08-13",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S041",
    "วันที่": "2026-08-13",
    "สาขา": "สำนักงาน",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S042",
    "วันที่": "2026-08-13",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S043",
    "วันที่": "2026-08-14",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S044",
    "วันที่": "2026-08-14",
    "สาขา": "สำนักงาน",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 4,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S045",
    "วันที่": "2026-08-14",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 3,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S046",
    "วันที่": "2026-08-14",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S047",
    "วันที่": "2026-08-15",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 3,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S048",
    "วันที่": "2026-08-15",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 4,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S049",
    "วันที่": "2026-08-15",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S050",
    "วันที่": "2026-08-16",
    "สาขา": "สำนักงาน",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S051",
    "วันที่": "2026-08-16",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S052",
    "วันที่": "2026-08-16",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 15,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S053",
    "วันที่": "2026-08-17",
    "สาขา": "สำนักงาน",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S054",
    "วันที่": "2026-08-17",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 2,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S055",
    "วันที่": "2026-08-17",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 20,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S056",
    "วันที่": "2026-08-18",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S057",
    "วันที่": "2026-08-18",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S058",
    "วันที่": "2026-08-18",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 19,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S059",
    "วันที่": "2026-08-18",
    "สาขา": "สำนักงาน",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 3,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S060",
    "วันที่": "2026-08-19",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S061",
    "วันที่": "2026-08-19",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S062",
    "วันที่": "2026-08-19",
    "สาขา": "สำนักงาน",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 4,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S063",
    "วันที่": "2026-08-20",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 15,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S064",
    "วันที่": "2026-08-20",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 19,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S065",
    "วันที่": "2026-08-20",
    "สาขา": "สำนักงาน",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S066",
    "วันที่": "2026-08-21",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 2,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S067",
    "วันที่": "2026-08-21",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 20,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S068",
    "วันที่": "2026-08-21",
    "สาขา": "สำนักงาน",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S069",
    "วันที่": "2026-08-22",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S070",
    "วันที่": "2026-08-22",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 13,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S071",
    "วันที่": "2026-08-22",
    "สาขา": "สำนักงาน",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 7,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S072",
    "วันที่": "2026-08-23",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S073",
    "วันที่": "2026-08-23",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S074",
    "วันที่": "2026-08-23",
    "สาขา": "สำนักงาน",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 2,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S075",
    "วันที่": "2026-08-23",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S076",
    "วันที่": "2026-08-24",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 19,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S077",
    "วันที่": "2026-08-24",
    "สาขา": "สำนักงาน",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S078",
    "วันที่": "2026-08-24",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 12,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S079",
    "วันที่": "2026-08-25",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S080",
    "วันที่": "2026-08-25",
    "สาขา": "สำนักงาน",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S081",
    "วันที่": "2026-08-25",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 7,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S082",
    "วันที่": "2026-08-26",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 9,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S083",
    "วันที่": "2026-08-26",
    "สาขา": "สำนักงาน",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 15,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S084",
    "วันที่": "2026-08-26",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S085",
    "วันที่": "2026-08-27",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S086",
    "วันที่": "2026-08-27",
    "สาขา": "สำนักงาน",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S087",
    "วันที่": "2026-08-27",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S088",
    "วันที่": "2026-08-27",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 7,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S089",
    "วันที่": "2026-08-28",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชาไทย",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 11,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 18
  },
  {
    "รหัสรายการ": "S090",
    "วันที่": "2026-08-28",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "บราวนี",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 2,
    "ราคาขายต่อหน่วย (บาท)": 55,
    "ต้นทุนต่อหน่วย (บาท)": 22
  },
  {
    "รหัสรายการ": "S091",
    "วันที่": "2026-08-28",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ลาเต้",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 28
  },
  {
    "รหัสรายการ": "S092",
    "วันที่": "2026-08-29",
    "สาขา": "สำนักงาน",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 10,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S093",
    "วันที่": "2026-08-29",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S094",
    "วันที่": "2026-08-29",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 7,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S095",
    "วันที่": "2026-08-30",
    "สาขา": "สำนักงาน",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 15,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  },
  {
    "รหัสรายการ": "S096",
    "วันที่": "2026-08-30",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "อเมริกาโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 8,
    "ราคาขายต่อหน่วย (บาท)": 60,
    "ต้นทุนต่อหน่วย (บาท)": 20
  },
  {
    "รหัสรายการ": "S097",
    "วันที่": "2026-08-30",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "โกโก้",
    "หมวดหมู่": "เครื่องดื่มอื่น",
    "จำนวนขาย (หน่วย)": 20,
    "ราคาขายต่อหน่วย (บาท)": 65,
    "ต้นทุนต่อหน่วย (บาท)": 25
  },
  {
    "รหัสรายการ": "S098",
    "วันที่": "2026-08-31",
    "สาขา": "สำนักงาน",
    "สินค้า": "ชีสเค้ก",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 14,
    "ราคาขายต่อหน่วย (บาท)": 110,
    "ต้นทุนต่อหน่วย (บาท)": 72
  },
  {
    "รหัสรายการ": "S099",
    "วันที่": "2026-08-31",
    "สาขา": "ห้างสรรพสินค้า",
    "สินค้า": "คาปูชิโน",
    "หมวดหมู่": "กาแฟ",
    "จำนวนขาย (หน่วย)": 5,
    "ราคาขายต่อหน่วย (บาท)": 75,
    "ต้นทุนต่อหน่วย (บาท)": 27
  },
  {
    "รหัสรายการ": "S100",
    "วันที่": "2026-08-31",
    "สาขา": "มหาวิทยาลัย",
    "สินค้า": "ครัวซองต์",
    "หมวดหมู่": "เบเกอรี",
    "จำนวนขาย (หน่วย)": 15,
    "ราคาขายต่อหน่วย (บาท)": 85,
    "ต้นทุนต่อหน่วย (บาท)": 60
  }
];